{"inkVersion":21,"root":[["^EVENT:PLAY:CASE_START","\n","^Judge: The court is now again in session for the trial of Mr.Santa Claus.","\n","^Krampus: The prosecution is ready, Your Honour.","\n","^You: Before we begin, Your Honour, my defendant would like to submit this as evidence.","\n","^EVIDENCE:ATTENDANCE","\n","^You: He believes it may be useful later on.","\n","^Judge: Very well. Let us proceed then.","\n","^Krampus: Thank you, Your Honour.","\n","^Krampus: Today is another day we uncover one of Mr.Claus's acts of crime.","\n","^Krampus: This one is related to none other than his previous reindeer.","\n","^You: (I've prepared for this. If there's no hard evidence, we should be in the clear.)","\n","^Krampus: The court may be aware of the incident regarding his reindeer last night.","\n","^Krampus: What you might not know is the horrid state of the poor animal!","\n","^Krampus: I bring forward a surprise witness today who can testify to Santa's mistreatment of the beasts.","\n","^You: (A surprise witness?!) ","#","^surprise","/#","\n","^Krampus: The prosecution calls forth Ms.Rose Witherspoon!","\n","^Rose: Oh, it is simply my pleasure to be here, Mr.Krampus.","\n","^Krampus: Witness, please state your name and profession to the court.","\n","^Rose: It is none other than I!","\n","^Rose: The great!","\n","^Rose: The glorious!","\n","^Rose: The majestic!","\n","^Rose: Roooooooooooooseeeeeee Witherspoon!","\n","^Rose: You are all now graced with my divine presence.","\n","^Judge: Wow! It is lovely to meet you. ","#","^blush","/#","\n","^You: (What is going on here...)","\n","^Krampus: Keep it short, woman. What is your occupation.","\n","^Rose: I'm an animal rescuer! You could say I'm something like a vigilante.","\n","^Krampus: It is to my understanding that you acquired critical evidence this morning?","\n","^Rose: Indeed. I have acquired hard, undeniable evidence of Mr.Claus's animal cruelty.","\n","^Judge: Well, let's get into it, shall we?","\n","^Judge: Ms.Witherspoon, please testify to the court on the evidence you have.","\n","^Rose: It would be my absolute pleasure!","\n","^EVENT:TESTIFY:ROSE","\n","^Rose: This morning, one of Mr.Claus's reindeers showed up at our doorstep at aroud 10:00 this morning.","\n","^Rose: It appeared to be lost and shook.","\n","^Rose: We took the kind animal in and ran many tests on it.","\n","^Rose: Our tests revealed that the animal was severely malnourished!","\n","^Rose: The poor reindeer had been eating poorly for so many years!","\n","^Rose: It was also visibly exhausted and dehydrated.","\n","^Rose: I suspect it didn't have any water the entire day!","\n","^Rose: These reindeer are looked after by Santa, right? How could he treat them in such a way!","\n","^Krampus: It is clear that Mr.Claus is in clear violation of animal rights.","\n","^Krampus: No domesticated reindeer should live under those conditions.","\n","^Judge: Very well, the defense may begin their cross-examination.","\n","^EVENT:CROSS_EXAMINATION","\n","^You: (This is incredibly fishy...)","\n","^You: (I'm missing too much information. I have to dig deeper.)","\n",{"->":"QUESTION"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"QUESTION":["^You: (There are too many pieces missing...)","\n","ev",{"VAR?":"asked_organisation"},false,"==","/ev",[{"->":".^.b","c":true},{"b":["\n","ev","str","^Ask about Rose","/str","/ev",{"*":".^.c-0","flg":20},{"->":".^.^.^.8"},{"c-0":["\n",{"->":"ORGANISATION"},{"#f":5}]}]}],"nop","\n","ev",{"VAR?":"asked_reindeer"},false,"==","/ev",[{"->":".^.b","c":true},{"b":["\n","ev","str","^Ask about the reindeer","/str","/ev",{"*":".^.c-0","flg":20},{"->":".^.^.^.16"},{"c-0":["\n",{"->":"REINDEER"},{"#f":5}]}]}],"nop","\n","ev",{"VAR?":"asked_organisation"},true,"==",{"VAR?":"asked_reindeer"},true,"==","&&","/ev",[{"->":".^.b","c":true},{"b":["\n",{"->":"ALL_ASKED"},{"->":".^.^.^.28"},null]}],"nop","\n",{"#f":1}],"ORGANISATION_1":["done",{"#f":1}],"ORGANISATION":["ev",true,"/ev",{"VAR=":"asked_organisation","re":true},"^You: How are you doing today, Ms.Witherspoon?","\n","^Rose: Me? I'm doing absolutely splendid, thank you for asking!","\n","^Rose: I just got my hair done-up and fancy for this trial!","\n","^Rose: Are you watching, world? Rose Witherspoon is going to steal everyone's hearts!","\n","^Judge: Ohhh you've stolen mine, dear lady! ","#","^blush","/#","\n","^Krampus: Get back on track! I don't have all day.","\n","^You: (Didn't learn anything there.)","\n",{"->":"QUESTION"},{"#f":1}],"REINDEER":["ev",true,"/ev",{"VAR=":"asked_reindeer","re":true},"^You: You said that the reindeer just showed up at your doorstep. Why do you think that is?","\n","^Rose: There could be many different reasons. I couldn't tell you for certain.","\n","^Rose: From what it looked like, the reindeer was very disoriented. After all, it didn't have any food or water for so long.","\n","^Rose: It was also walking around for such a long time.","\n","^Krampus: A lost reindeer. How reflective of the owner's diligence and care towards his animals.","\n","^You: (Something's not adding up here...)","\n",{"->":"QUESTION"},{"#f":1}],"ALL_ASKED":["^You: Your Honour, everything the witness said seems to check out.","\n","^You: However, I believe Santa isn't the one responsible here.","\n",{"->":"RESPONSIBLE"},{"#f":1}],"RESPONSIBLE":[["^You: The person(s) responsible was actually...","\n","ev","str","^Rose herself!","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^The elves!","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["\n","^Rose: What! How dare you fling baseless accusations at me!","\n","^Rose: I haven't even seen this reindeer before today!","\n","^Krampus: You twerp, Rose has alibis already. She hasn't been involved until today.","\n","^You: (Hm, did I get that wrong?)","\n",{"->":".^.^.^"},{"#f":5}],"c-1":["\n","^Judge: Ooo!","\n","^Judge: Ahem, I mean, what makes you say that?","\n",{"->":"ELVES"},{"#f":5}]}],{"#f":1}],"ELVES":[["^You: I have a piece of evidence that will prove my defendant's non-involvement.","\n","^EVENT:EVIDENCE","\n","ev","str","^ATTENDANCE","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^CAROLS","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^COOKIES","/str","/ev",{"*":".^.c-2","flg":4},"ev","str","^OTHER","/str","/ev",{"*":".^.c-3","flg":4},{"c-0":["\n",{"->":"ATTENDANCE"},"^You: This health report!","\n","^Krampus: The Defense is grasping for straws, Your Honour.","\n",{"->":"FAIL_ELVES"},{"#f":5}],"c-1":["\n","^Krampus: Are you trying to sing to us, twerp?","\n",{"->":"FAIL_ELVES"},{"#f":5}],"c-2":["\n","^Rose: Oh my, those would be terrible for my figure.","\n",{"->":"FAIL_ELVES"},{"#f":5}],"c-3":["\n","^Judge: Aha of course!","\n","^Judge: Wait... what do these prove exactly?","\n","^Krampus: This proves nothing, twerp.","\n",{"->":"FAIL_ELVES"},{"#f":5}]}],{"#f":1}],"FAIL_ELVES":["^Judge: I don't see the connection here...","\n","^Judge: I see no reason to continue! The court is dismissed.","\n","^You: (I messed that up...)","\n","^You: Hold on a sceond!","\n",{"->":"ELVES"},{"#f":1}],"ATTENDANCE":["^You: Ms.Witherspoon stated that Prancer showed up at her doorstep at precisely 10:00 this morning.","\n","^You: At 9:40 today, we took attendance of the elves.","\n","^You: And it just so happened that the elf responsible for Prancer was missing during this time!","\n","^Judge: Oh my! How suspicious!","\n","^Krampus: That proves nothing, twerp.","\n","^Krampus: And even if it did, that elf you mentioned happens to be here today.","\n","^Krampus: And he's a key witness, hehehe.","\n","^You: (Oh no, did Krampus see this coming?)","\n","^Krampus: Indeed. My next witness is none other than the elf responsible for the reindeer.","\n","^Krampus: And he can testify at length to Santa's mistreatment.","\n","^You: (It was a setup! I'll have to be more careful next time.)","\n",{"->":"CONTINUE"},{"#f":1}],"CONTINUE":["^Krampus: Ms.Witherspoon, thank you for your cooperation.","\n","^Rose: Why, it was your pleasure to have me.","\n","^You: ... our pleasure?","\n","^Krampus: The prosecution calls forth Buddy the Elf.","\n","^Buddy: Oh boy, that's me!","\n","^Krampus: Elf. State your name and occupation.","\n","^Buddy: I'm Buddy the Elf! First Name: Buddy, Last Name: The Elf!","\n","^Buddy: I'm Santa's one and only head elf!","\n","^Buddy: Cleaning, feeding, wrapping, singing...","\n","^Buddy: There's nothing I can't do!","\n","^Krampus: Can you be more brief?","\n","^Buddy: Why what a mean thing to say!","\n","^Krampus: Can you testify to the court what you observed? And keep it snappy.","\n","^Buddy: Why, that I can do!","\n","^EVENT:TESTIFY:BUDDY","\n","^Buddy: It was a fog-enveloped night.","\n","^Buddy: Snow was falling lightly upon the hardened cement outside our lodging.","\n","^Buddy: When the slience of the evening was suddenly pierced by a shrieking cry!","\n","^Buddy: I woke in fright and rushed to the attend to the reindeers.","\n","^Buddy: Alas, I have grown all too comfortable with their painful cries.","\n","^Buddy: Banging was coming from the shed as I slowly approached it.","\n","^Buddy: When the wooden doors burst open from the inside!","\n","^Buddy: Prancer dashed by my side, knocking me away.","\n","^Buddy: I chased after him all night and morning.","\n","^Buddy: But to no avail.","\n","^Buddy: By the time I had gotten back, the other elves had already reported this.","\n","^Judge: What a dreadful story! Are you doing alright, son?","\n","^Buddy: Why yes, thank you for your concern, Your Honour.","\n","^You: (At this rate, I'm gonna lose the judge to their side!)","\n","^Krampus: Elf. Why do you think Prancer escaped the shed?","\n","^Buddy: I'm afraid to say, we simply don't have enough resources to take care of them.","\n","^Buddy: Santa doesn't give us enough food nor time. Us elves are expected to work day and night attending to these reindeer.","\n","^Buddy: We barely have time to ourselves! How can we be expected to take care of nine gigantic beasts!","\n","^Buddy: And that's why I'm here today. Santa, bless his poor heart, has tried his best, but his practices are too outdated.","\n","^Buddy: It's time for us to move on.","\n","^Judge: What a touching perspective...","\n","^You: Excuse me, Your Honour! I believe I am owed a cross-examination!","\n","^Judge: You really want to bully this poor boy? That's not a good look, you know.","\n","^You: It's your job!","\n","^Judge: Very well, you may begin your cross examination!","\n","^EVENT:CROSS_EXAMINATION","\n",{"->":"BUDDY_QUESTION"},{"#f":1}],"BUDDY_QUESTION":["^You: (He has to be lying. I'll need something to contradict his testimony...)","\n","ev",{"VAR?":"asked_shed"},false,"==","/ev",[{"->":".^.b","c":true},{"b":["\n","ev","str","^Ask about the shed","/str","/ev",{"*":".^.c-0","flg":20},{"->":".^.^.^.8"},{"c-0":["\n",{"->":"BUDDY_SHED"},{"#f":5}]}]}],"nop","\n","ev",{"VAR?":"asked_lock"},false,"==","/ev",[{"->":".^.b","c":true},{"b":["\n","ev","str","^Ask about the lock","/str","/ev",{"*":".^.c-0","flg":20},{"->":".^.^.^.16"},{"c-0":["\n",{"->":"BUDDY_LOCK"},{"#f":5}]}]}],"nop","\n","ev",{"VAR?":"asked_shed"},true,"==",{"VAR?":"asked_lock"},true,"==","&&","/ev",[{"->":".^.b","c":true},{"b":["\n",{"->":"BUDDY_ALL_ASKED"},{"->":".^.^.^.28"},null]}],"nop","\n",{"#f":1}],"BUDDY_SHED":["ev",true,"/ev",{"VAR=":"asked_shed","re":true},"^You: Are all of Santa's reindeer kept in that shed?","\n","^Buddy: Of course, but the shed is so small, they're packed like sardines.","\n","^Buddy: I keep insisting we get more space, but my concerns fall on deaf ears.","\n","^You: If that's the case, why did only Prancer escape?","\n","^Buddy: The other reindeer were too tired, I'd say. All of them have had a hard time recently, and it doesn't help that they aren't fed well.","\n","^Judge: The poor animals...","\n","^You: (He turned the tide on me!)","\n",{"->":"BUDDY_QUESTION"},{"#f":1}],"BUDDY_LOCK":["ev",true,"/ev",{"VAR=":"asked_lock","re":true},"^You: The lock that secured it, how was it broken?","\n","^Buddy: Prancer must have been so desperate to escape, he broke the lock from inside! I can only sympathise with him...","\n","^Buddy: Animals can do amazing things when pushed to the brink. I'm sure we can all relate to that.","\n","^Judge: I totally get you, Buddy.","\n","^You: (This is going to be hard...)","\n",{"->":"BUDDY_QUESTION"},{"#f":1}],"BUDDY_ALL_ASKED":["^You: (I know Buddy helped Prancer escaped. But I can't prove that with what little evidence I have)","\n","^You: (I'll have to take a different route.)","\n","^You: (I need to put him on the spot!)","\n",{"->":"BUDDY_ACCUSE"},{"#f":1}],"BUDDY_ACCUSE":[["^You: Buddy! I have reason to believe that it was not Prancer who broke the lock! It was...","\n","ev","str","^You!","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Rose!","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["\n","^Buddy: How.. how can you say that!","\n","^Buddy: If you want proof, I got proof!","\n","^Krampus: Buddy, not yet!","\n","^Buddy: I have photographic evidence that I was searching for Prancer with all my might!","\n","^Krampus: (He's gone and done it...)","\n","^You: Oh? And what evidence might that be?","\n","^Buddy: Feast your eyes on my brilliant photography!","\n","^EVENT:PHOTO:TRACKS","\n","^Buddy: These are photos of Prancer's tracks.","\n","^Buddy: I followed them all the way from the shed.","\n","^Buddy: I never go anywhere without my camera.","\n","^Buddy: Before I wanted to be an elf, I wanted to be a wedding photographer!","\n",{"->":"INTERROGATE_PHOTO"},{"#f":5}],"c-1":["\n","^Buddy: What are you talking about?","\n","^You: You two are in cahoots!","\n","^Krampus: Rose has already left the buliding to take papparazzi photos.","\n","^Judge: Let me go!","\n","^You: Ah.","\n",{"->":".^.^.^"},{"#f":5}]}],{"#f":1}],"INTERROGATE_PHOTO":[["^You: (There's something off about this photo... if I look carefully, I can just about see...)","\n","^EVENT:EVIDENCE","\n","ev","str","^COOKIES","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^OTHER","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["\n",{"->":"COOKIES_PHOTO"},{"#f":5}],"c-1":["\n","^You: No, that's not it, it's something else...","\n",{"->":".^.^.^"},{"#f":5}]}],{"#f":1}],"COOKIES_PHOTO":["^EVENT:PHOTO:HIDE","\n","^You: Your Honour! Buddy was not the one who took Prancer to Rose!","\n","^Buddy: Of course it wasn't me!","\n","^EVENT:SHAKE","\n","^EVENT:PLAY:CASE_BREAK","\n","^You: It was the double butter triple chocolate chip cookies!","\n","^Judge: Whaaaat?!","\n","^Krampus: When can we escape these blasted cookies.","\n","^You: Buddy laid a trail of these cookies, leading Prancer to Rose!","\n","^You: He's the one who broke Prancer out and framed all this.","\n","^Krampus: You imbecile, are you telling me that Santa's reindeers eat cookies?! I find that absolutely preposterous.","\n",{"->":"CHOOSE_FOOD"},{"#f":1}],"CHOOSE_FOOD":[["^You: (I have to find something to show they eat cookies!)","\n","^EVENT:EVIDENCE","\n","ev","str","^REINDEER_FOOD","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^OTHER","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["\n",{"->":"SUBMIT_FOOD"},{"#f":5}],"c-1":["\n","^Krampus: That shows nothing!","\n","^Judge: Of course reindeers don't eat cookies! You are a buffoon!","\n","^You: (What was it then?!)","\n",{"->":".^.^.^"},{"#f":5}]}],{"#f":1}],"SUBMIT_FOOD":["^You: This is a box of food given to all of Santa's reindeers.","\n","^Buddy: Wait, don't-","\n","^You: But if I open them...","\n","^EVENT:SHAKE","\n","^You: They are full of cookies!","\n","^Judge: I can't believe it!","\n","^Krampus: What kind of monster...","\n","^Buddy: I swear I've never seen that before in my life!","\n","^Buddy: Lies, I tell you, lies!","\n","^You: Buddy has been feeding the reindeer purely cookies over the last few years, leading to their severe malnutrition and current state.","\n","^Buddy: I have nothing to do with the cookies!","\n","^You: Is that why you coerced children around the world to eat cookies left out by Santa?","\n","^Buddy: I... I don't know what you are talking about.","\n","^You: \"If you don’t eat Santa’s treats tonight\"","\n","^You: \"He’ll think you’ve been naughty, but that's not quite right\"","\n","^You: \"So munch those cookies to keep his delight!\"","\n",{"->":"CAROL"},{"#f":1}],"CAROL":[["^You: Why that sounds exactly like...","\n","^EVENT:EVIDENCE","\n","ev","str","^CAROLS","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^OTHER","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["\n",{"->":"SUBMIT_CAROLS"},{"#f":5}],"c-1":["\n","^You: (That's not right...)","\n",{"->":"CAROL"},{"#f":5}]}],{"#f":1}],"SUBMIT_CAROLS":["^EVENT:SHAKE","\n","^You: The Christmas Carols you wrote!","\n","^Buddy: No! That's not true","\n","^Krampus: You imbecile, stop talking!","\n","^Krampus: These allegations have gone far enough. You stil lack hard proof of Buddy's involvement.","\n","^You: You're right, Krampus. But that was until he showed me the photo he took.","\n","^You: I couldn't help but notice, they were so similar to something I had seen before.","\n","^You: And I couldn't understand why until now.","\n",{"->":"PHOTOS"},{"#f":1}],"PHOTOS":[["^You: This will be my last piece of evidence to the court.","\n","^EVENT:EVIDENCE","\n","ev","str","^PHOTOS","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^OTHER","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["\n",{"->":"SUBMIT_PHOTOS"},{"#f":5}],"c-1":["\n","^You: (That's not right...)","\n",{"->":"PHOTOS"},{"#f":5}]}],{"#f":1}],"SUBMIT_PHOTOS":["^Buddy: I've never seen those before!","\n","^You: Santa has been receiving threats attached with these photos.","\n","^You: Look at the film used! They match Buddy's previous photos!","\n","^EVENT:SHAKE","\n","^Buddy: NO!","\n","^You: Well, we can take your camera right now and prove everyone otherwise.","\n","^Buddy: That's... not allowed...","\n","^Judge: Oh it is.","\n","^Krampus: It is.","\n","^You: But I've always wondered... Why are there so many photos of Mrs.Claus mixed in here?","\n","^You: Until I realised. This isn't about Santa.","\n","^EVENT:SHAKE","\n","^You: This is about you and her!","\n","^You: Your Honour, this is a crime of passion.","\n","^Judge: What are you talking about?","\n","^EVENT:SHAKE","\n","^Buddy: Objection! Objection! Objection! Stop!","\n","^You: If we open Buddy's camera. I think we'll find a lot more than just photos of reindeer.","\n","^EVENT:SHAKE","\n","^Buddy: You don't understand! It was out of love!","\n","^Buddy: None of you would understand it!","\n","^Buddy: He doesn't deserve her! He doesn't deserve any of it!","\n","^You: Buddy manipulated children around the world.","\n","^You: Starved Santa's reindeers for years.","\n","^You: Framed an escape and brought them to the public eye.","\n","^You: Just to bring down Santa.","\n","^You: Just to be with Mrs.Claus.","\n","^Judge: Oh. My God.","\n","^Krampus: This is... new.","\n","^Buddy: ...","\n","^You: You can take his silence for an answer. And I'm sure his camera will reveal the truth.","\n","^Judge: I've heard enough, this case is closed!","\n","^You: Thank you, ladies and gentlemen.","\n","^You: And have a Merry Christmas.","\n","^EVENT:COMPLETE","\n","done",{"#f":1}],"global decl":["ev",false,{"VAR=":"organisation"},false,{"VAR=":"accent"},false,{"VAR=":"reindeer"},false,{"VAR=":"wrong"},false,{"VAR=":"asked_organisation"},false,{"VAR=":"asked_reindeer"},false,{"VAR=":"asked_shed"},false,{"VAR=":"asked_lock"},"/ev","end",null],"#f":1}],"listDefs":{}}