{"inkVersion":21,"root":[["^You: Thank you for meeting me on such short notice, Santa. I know it's a long way away from the North Pole.","\n","^Santa: Ho, ho, ho! Nothing is ever too far for Rudolph and I.","\n","^Santa: Thank you for helping me with this.","\n","^Santa: I know the situation seems bad, but I promise you I'm a good person.","\n","^Santa: I've been working this job for thousands of years and have never had any problems.","\n","^Santa: Tell me, what are we going to do?","\n","^You: Well, Santa. I'll be straight. It's not looking good.","\n","^You: You're facing charges for Breaking and Entering, Animal Abuse, and Unfair Labour Practices.","\n","^You: On top of that, they have three witnesses that are willing to testify for all of these charges.","\n","^You: Even one of your elf workers, Buddy, is appearing at the trial.","\n","^Santa: Oh dear. Buddy has been Mrs.Claus and I's personal assistant for many yeras. I don't know why he would do this...","\n","^You: Well, like any trial. We have to prepare.","\n","^You: From this moment until the trial starts, you're going to have to tell me everything and we need to prepare as much evidence as possible.","\n","^Santa: Very well, where should we start?","\n","^You: Let's start with what you normally do each year.","\n","^Santa: Well each year begins the same way.","\n","^Santa: We spend the entire year preparing for the big day.","\n","^Santa: The elves work tirelessly researching the latest presents, monitoring the Naughty List, and taking care of the reindeer.","\n","^You: The infamous Naughty List. Is it true that it holds everything bad everyone has ever committed?","\n","^Santa: Ho, ho, ho! Of course. But it's not that specific. It only has a vague statement of what they did.","\n","^You: That's a shame, it could solve every single case if it were fully decriptive.","\n","^You: But it could be useful... It could be used to force an admission of guilt.","\n","^You: Do you mind if I take a copy for the trial?","\n","^Santa: Why of course! Just don't let any kids see it for next year!","\n","^EVIDENCE:NAUGHTY_LIST","\n","^You: And what do you do on the night of Christmas Eve?","\n","^Santa: Ho, ho, ho! Oh, where do I begin?","\n","^Santa: Once all the presents are stored in my rucksack, I giddy up my trusty reindeer entourage, and travel around the world in a split second.","\n","^You: How is that even possible?","\n","^Santa: Preparation, preparation, preparation! I spend months optimising the route and the stacking of presents. It's logistically challenging.","\n","^You: Do you have any evidence of this?","\n","^Santa: Here's my notebook from last year! The math will shock you.","\n","^EVIDENCE:NOTEBOOK","\n","^You: Also, how do you travel so fast?","\n","^Santa: Ho, ho, ho! Trade secrets. I can't expose them to any competition.","\n","^You: Very well.","\n","^Santa: But I'll be honest, all this has been very stressful and my body has taken a toll over the years.","\n","^You: How so?","\n","^Santa: Well, I've always been diagnosed with Type 2 Diabetes.","\n","^You: Oh, I'm sorry to hear that.","\n","^Santa: Ho, ho, ho! Don't be!","\n","^Santa: The worst part is having to abstain from snacks all year round!","\n","^You: That's... interesting. Do you have a health report?","\n","^Santa: Of course! I'm in tip-top shape ever since Mrs.Claus put me on a diet two hundred years ago!","\n","^EVIDENCE:HEALTH_REPORT","\n","^You: Anyways, let's talk about your reindeer.","\n","^Santa: Of course!","\n","^You: You're being charged on several counts of animal cruelty, including immoral labour and forced captivity.","\n","^Santa: Nonsense! My reindeer have been part of my family since the beginning!","\n","^Santa: I raised them from calves and take care of them everyday!","\n","^You: I guess these charges are more like accusations. It's easy for someone on the outside to think they're being forced to run around the world.","\n","^You: You can't bring a reindeer on as a witness either.","\n","^You: Do you have a copy of your reindeer caretaking schedule?","\n","^Santa: Of course.","\n","^EVIDENCE:REINDEER_SCHEDULE","\n","^You: Thanks. Let's move onto your elves.","\n","^Santa: Why, my dear friend. They're not mine.","\n","^You: What do you mean?","\n","^Santa: Why, they're orphans. They come to the North Pole to seek refuge for a variety of reasons, most being abusive families.","\n","^You: That's... actually amazing!","\n","^Santa: Ho, ho, ho!","\n","^You: Which begs the question, do you know why Buddy is testifying against you?","\n","^Santa: The elves have been unhappy with their living standards for a while now.","\n","^Santa: But there's only so much we can do. We're in the North Pole after all.","\n","^Santa: The living conditions aren't exactly desirable.","\n","^You: Buddy and his fellow elves have been on strike for the past month, demanding better wages and working conditions. It seems like they get little holidays and worker's rights?","\n","^Santa: They're not exactly employed, it is an orphanage. But we're not registered as one officially.","\n","^Santa: Also, this trial has brought a lot of public eyes to my work. We've been receiving a mountain of threats each day...","\n","^You: That sounds horrible.","\n","^Santa: I know. They've been sending threats with photos of my family and I attached. I don't know how they even got these!","\n","^You: (You skim through the photos. There are a lot of Santa, but also of Mrs.Claus.)","\n","^You: That's... interesting. Do you mind if I bring these along too?","\n","^Santa: Go for it, young man.","\n","^EVIDENCE:PHOTOS","\n","^You: I think that's enough to wrap up today. Thanks for cooperating Santa.","\n","^Santa: Ho, ho, ho! Anytime.","\n","^You: With what you've told me, each of these witnesses could be lying and it is up to me to present the evidence and find contradictions in their testimonies.","\n","^Santa: Thank you.","\n","^Santa: The future of Christmas is counting on you, young man.","\n","ev",{"x()":"complete"},"pop","/ev","\n","end",["done",{"#f":5,"#n":"g-0"}],null],"done",{"#f":1}],"listDefs":{}}