{"inkVersion":21,"root":[["^You: Thank you for meeting me on such short notice, Santa. I know it's a long way away from the North Pole.","\n","^Santa: Ho, ho, ho! Nothing is ever too far for Rudolph and I.","\n","^Santa: Thank you for helping me with this.","\n","^Santa: I know the situation seems bad, but I promise you I'm a good person.","\n","^Santa: You could even say I'm a...","\n","^EVENT:SHAKE","\n","^Santa: JOLLY PERSON! ","#","^laugh","/#","\n","^Santa: HO, HO, HO! ","#","^laugh","/#","\n","^You: (This is going to be a long day...)","\n","^Santa: I've had the pleasure of working this job for thousands of years, and I've never had any problems until now.","\n","^Santa: Tell me son, what are we going to do?","\n","^You: Well, Santa. I'll be straight. It's not looking good.","\n","^You: You're facing several criminal charges on multiple counts.","\n","^You: On top of that, they have three witnesses that are willing to testify for all of these charges.","\n","^You: Even one of your elf workers, Buddy, is appearing at the trial.","\n","^Santa: Buddy?! He's my head elf! Why would he do something like this...","\n","^Santa: He's been with Mrs.Claus and I for years. I don't understand why he would do this...","\n","^You: Well, like. We have to prepare.","\n","^You: From this moment until the trial starts, you're going to have to tell me everything and we need to prepare as much evidence as possible.","\n","^Santa: Ho, ho, ho! That's the spirit, young lad! ","#","^laugh","/#","\n","^Santa: Very well then! Where should we start?","\n","^You: Let's start with what you normally do each year.","\n","^Santa: Well each year begins the same way.","\n","^Santa: We spend months preparing for the big day.","\n","^Santa: The elves work tirelessly researching the latest presents, monitoring the Naughty List, and taking care of the reindeer.","\n","^You: Ahh, the infamous Naughty List. Is it true that it holds everything bad everyone has ever committed?","\n","^EVENT:SHAKE","\n","^Santa: Of course it does! ","#","^laugh","/#","\n","^Santa: I's my pride and joy. Every single name of anyone who has been naughty that year.","\n","^You: That's incredibly powerful. Couldn't it solve literally every single court case?","\n","^Santa: Ah my boy, that it cannot do.","\n","^Santa: For it only shows the name of the naughty-doers, not the deed.","\n","^You: That's a shame, but I guess it'd be too overpowered otherwise.","\n","^You: But it could be useful... It could be used to force an admission of guilt.","\n","^You: Do you mind if I take a copy for the trial?","\n","^Santa: Why of course!","\n","^Santa: Just don't let any kids see it for next year! ","#","^laugh","/#","\n","^EVIDENCE:NAUGHTY_LIST","\n","^Santa: At the beginning of December, we distribute the Christmas Carols!","\n","^You: The Carols? They're made by you?","\n","^Santa: Ho, ho, ho! Not by me, young, I couldn't sing to save my life! ","#","^laugh","/#","\n","^Santa: They're made by the elves each year. Nearly won Grammies, they have!","\n","^You: That's impressive.","\n","^Santa: Have last year's copy!","\n","^You: ...thank you?","\n","^EVIDENCE:CAROLS","\n","^You: And what do you do on the night of Christmas Eve?","\n","^Santa: What a mighty question, my boy! Let's see...","\n","^Santa: After months of wrapping presents, we pack them in my bottomless rucksack.","\n","^Santa: Then, I giddy up my trusty reindeer entourage, and travel around the world in a split second!","\n","^Santa: It's as simple as that! ","#","^laugh","/#","\n","^You: How is that even possible?","\n","^Santa: Preparation, preparation, preparation!","\n","^Santa: I spend months optimising the route and the stacking of presents. It's logistically challenging.","\n","^You: Do you have any evidence of this?","\n","^Santa: Here's my notebook from last year! The math will shock you.","\n","^EVIDENCE:NOTEBOOK","\n","^You: Also... how do you travel so fast?","\n","^Santa: Ho, ho, ho! Those are deeply held trade secrets, my boy. I can't expose them to other competition.","\n","^You: Fair enough.","\n","^Santa: But I'll be honest, all this has been very stressful and my body has taken a toll over the years.","\n","^You: How so?","\n","^Santa: Years of candy canes, cookies, milk will do that to you.","\n","^Santa: And now, I'm a Type 2 Diabetic! ","#","^laugh","/#","\n","^Santa: Ho, ho, ho! ","#","^laugh","/#","\n","^You: Oh, I'm sorry to hear that.","\n","^Santa: Ho, ho, ho! Don't be! ","#","^laugh","/#","\n","^Santa: The worst part is having to abstain from snacks all year round!","\n","^You: That's... interesting. Do you have a health report?","\n","^Santa: Of course! I'm in tip-top shape ever since Mrs.Claus put me on a diet two hundred years ago!","\n","^EVIDENCE:HEALTH_REPORT","\n","^You: Anyways, let's talk about your reindeer.","\n","^You: You're being charged on several counts of animal cruelty, including immoral labour and forced captivity.","\n","^Santa: Nonsense! My reindeer have been part of my family since the beginning!","\n","^You: I guess these charges are more like accusations. I don't see us losing unless they have hard proof of mistreatment.","\n","^Santa: Of course. I'd be nothing without my reindeer.","\n","^Santa: I always keep a pack of their food with me!","\n","^Santa: Almost knicked my bottoms many times because of that! ","#","^laugh","/#","\n","^Santa: Would you like some? I've got plenty! It takes so good, you can't stop eating them!","\n","^You: You've eaten their food?","\n","^EVIDENCE:REINDEER_FOOD","\n","^You: Thanks. Let's move onto your elves.","\n","^Santa: Why, my boy. They're not MY elves!","\n","^You: What do you mean?","\n","^Santa: They're orphans! Each and every one of them!","\n","^Santa: They come to the North Pole to seek refuge for a variety of reasons, most being abusive families.","\n","^You: That's... actually amazing! ","#","^surprise","/#","\n","^Santa: Ho, ho, ho!","\n","^You: Which begs the question, do you know why Buddy is testifying against you?","\n","^Santa: The elves have been unhappy with their living standards for a while now.","\n","^Santa: But there's only so much we can do. We're in the North Pole after all.","\n","^Santa: The living conditions aren't exactly desirable.","\n","^You: Buddy and his fellow elves have been on strike for the past month, demanding better wages and working conditions. It seems like they get little holidays and worker's rights?","\n","^Santa: They're not exactly employed, it is an orphanage. But we're not registered as one officially.","\n","^Santa: Also, this trial has brought a lot of public eyes to my work. We've been receiving a mountain of threats each day.","\n","^You: That sounds horrible.","\n","^Santa: I know. They've been sending threats with photos of my family and I attached.","\n","^Santa: I don't know how they even got these! ","#","^laugh","/#","\n","^You: (You skim through the photos. There are a lot of Santa)","\n","^You: (But also... there are a lot of photos with Mrs.Claus...)","\n","^You: That's... interesting. Do you mind if I bring these along too?","\n","^Santa: Go for it, young man.","\n","^EVIDENCE:PHOTOS","\n","^You: I think that's enough to wrap up today. Thanks for cooperating Santa.","\n","^Santa: Ho, ho, ho! Anytime, my boy. ","#","^laugh","/#","\n","^You: With what you've told me, each of these witnesses could be lying and it is up to me to present the evidence and find contradictions in their testimonies.","\n","^Santa: Thank you.","\n","^Santa: The future of Christmas is counting on you, young man.","\n","^EVENT:COMPLETE","\n","end",["done",{"#f":5,"#n":"g-0"}],null],"done",{"#f":1}],"listDefs":{}}